{
  "id": "images",
  "title": "Галерея пошуку зображень",
  "description": "Додаток на чистому JavaScript для пошуку та перегляду зображень з функціональністю галереї",
  "stack": "Vanilla JavaScript, Pixabay API, SimpleLightbox, Notiflix, Parcel",
  "link": "https://github.com/VikaSemenchuk/goit-js-hw-11",
  "image": "/projects/images.png",
  "featured": true,
  "role": "Фронтенд-розробниця",
  "detailed": {
    "overview": "Image Search Gallery — це додаток на ванільному JavaScript, який дозволяє користувачам шукати якісні зображення через Pixabay API. Проєкт містить нескінченну прокрутку з пагінацією, галерею з функціоналом lightbox та адаптивне компонування. Побудований без фреймворків, щоб продемонструвати чисті навички JavaScript та сучасні методи веброзробки.",
    "myRole": "Розробила повний фронтенд-додаток з використанням ванільного JavaScript та можливостей ES6+. Реалізувала інтеграцію з Pixabay API, створила адаптивні UI-компоненти, інтегрувала функціонал lightbox та забезпечила зручний досвід користування з обробкою завантаження та помилок. Зосередилась на чистій, модульній архітектурі без використання фреймворків.",
    "technologies": {
      "frontend": [
        "Vanilla JavaScript ES6+ — сучасні можливості та синтаксис JS",
        "HTML5 & CSS3 — семантична розмітка та сучасне стилювання",
        "SCSS — CSS-препроцесор для кращої організації стилів",
        "Parcel — сучасний інструмент збірки",
        "Modern Normalize — уніфікований стиль для браузерів"
      ],
      "libraries": [
        "Axios — HTTP-клієнт для API-запитів",
        "SimpleLightbox — елегантна галерея зображень",
        "Notiflix — сповіщення та алерти для користувача",
        "Pixabay API — пошук і отримання зображень"
      ],
      "architecture": [
        "Модульна архітектура з класами ES6",
        "Розділення логіки на окремі сервіси",
        "Подієво-орієнтоване програмування з обробкою подій",
        "Адаптивна сітка з CSS Grid і Flexbox",
        "Прогресивне покращення та стійкість до збоїв"
      ]
    },
    "features": [
      {
        "title": "Пошук і відкриття зображень",
        "description": "Пошук якісних зображень за ключовими словами, результати у вигляді адаптивної сітки, автоматична оптимізація зображень і ліниве завантаження, плавна нескінченна прокрутка"
      },
      {
        "title": "Галерея зображень",
        "description": "Lightbox-галерея з навігацією, перегляд зображень у повному розмірі із зумом, підтримка навігації з клавіатури, відображення метаданих зображень (вподобання, перегляди, завантаження, коментарі)"
      },
      {
        "title": "Інтерфейс і UX",
        "description": "Чистий, адаптивний дизайн, що працює на всіх пристроях, анімації завантаження, інформативні повідомлення про помилки, плавні переходи та ефекти наведення"
      },
      {
        "title": "Продуктивність і оптимізація",
        "description": "Ефективні запити до API з пагінацією, ліниве завантаження зображень, debounce-пошук для зменшення кількості запитів, оптимізований розмір бандлу за допомогою Parcel"
      }
    ],
    "achievements": [
      "Створено повнофункціональний додаток для пошуку зображень на чистому JavaScript",
      "Реалізовано ефективну систему пагінації з нескінченною прокруткою",
      "Адаптивний дизайн, що чудово виглядає на будь-яких пристроях",
      "Інтегровано зовнішній API з обробкою помилок і обмеженням запитів",
      "Забезпечено плавний UX із завантаженням і анімаціями",
      "Підтримка чистої, модульної структури коду без фреймворків"
    ],
    "stats": {
      "jsClasses": "3",
      "apiEndpoints": "1",
      "responsiveBreakpoints": "3",
      "imagesPerPage": "40",
      "bundleSize": "< 100KB"
    },
    "codeExamples": {
      "apiService": "...",
      "loadMoreButton": "...",
      "imageMarkup": "..."
    }
  }
}
